In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('gapminder_full.csv')

In [3]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [4]:
# revisin the concepts of loc and iloc

In [6]:
df.iloc[0:6,0:4]

       country  year  population continent
0  Afghanistan  1952     8425333      Asia
1  Afghanistan  1957     9240934      Asia
2  Afghanistan  1962    10267083      Asia
3  Afghanistan  1967    11537966      Asia
4  Afghanistan  1972    13079460      Asia
5  Afghanistan  1977    14880372      Asia

In [7]:
df.loc[0:6] # in loc the last value is included

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106
5  Afghanistan  1977    14880372      Asia    38.438  786.113360
6  Afghanistan  1982    12881816      Asia    39.854  978.011439

In [11]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [12]:
# df.loc[0:5,0:4]
df.loc[0:5,['country', 'year', 'population', 'continent']]

       country  year  population continent
0  Afghanistan  1952     8425333      Asia
1  Afghanistan  1957     9240934      Asia
2  Afghanistan  1962    10267083      Asia
3  Afghanistan  1967    11537966      Asia
4  Afghanistan  1972    13079460      Asia
5  Afghanistan  1977    14880372      Asia

In [13]:
# df.loc[0:5,0:4]
df.loc[0:5,'country':'continent'] #last value is included

       country  year  population continent
0  Afghanistan  1952     8425333      Asia
1  Afghanistan  1957     9240934      Asia
2  Afghanistan  1962    10267083      Asia
3  Afghanistan  1967    11537966      Asia
4  Afghanistan  1972    13079460      Asia
5  Afghanistan  1977    14880372      Asia

# operation in pandas

In [16]:
df['life_exp']

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: life_exp, Length: 1704, dtype: float64

In [17]:
type(df['life_exp'])

pandas.core.series.Series

In [19]:
df['life_exp'].max()

82.603

In [20]:
df['life_exp'].min()

23.599

In [21]:
df['life_exp'].mean()

59.47443936619714

In [22]:
df['life_exp'].count()

1704

In [23]:
df['life_exp'].sum()

101344.44467999999

In [24]:
df['life_exp'].max()

82.603

In [26]:
df['life_exp'] == 82.603

0       False
1       False
2       False
3       False
4       False
        ...
1699    False
1700    False
1701    False
1702    False
1703    False
Name: life_exp, Length: 1704, dtype: bool

In [27]:
df[df['life_exp'] == 82.603]

    country  year  population continent  life_exp      gdp_cap
803   Japan  2007   127467972      Asia    82.603  31656.06806

In [38]:
df[df['life_exp'] == 23.599]

     country  year  population continent  life_exp     gdp_cap
1292  Rwanda  1992     7290203    Africa    23.599  737.068595